In [1]:
import pandas as pd

In [2]:
csv_1 = pd.read_csv("C:\\Users\\Maniya Jain\\Documents\\Pandas Tutorial\\Test_1.csv")
csv_1

   A  B  C
0  1  2  4
1  0  3  9
2  4  0  5
3  6  9  6
4  7  6  1
5  3  8  2

In [3]:
# To access index
csv_1.index

RangeIndex(start=0, stop=6, step=1)

In [4]:
# To access columns
csv_1.columns

Index(['A', 'B', 'C'], dtype='object')

In [5]:
# Description of numerical values
csv_1.describe()

              A         B         C
count  6.000000  6.000000  6.000000
mean   3.500000  4.666667  4.500000
std    2.738613  3.559026  2.880972
min    0.000000  0.000000  1.000000
25%    1.500000  2.250000  2.500000
50%    3.500000  4.500000  4.500000
75%    5.500000  7.500000  5.750000
max    7.000000  9.000000  9.000000

In [6]:
csv_1.head() # give s the first 5 rows

   A  B  C
0  1  2  4
1  0  3  9
2  4  0  5
3  6  9  6
4  7  6  1

In [7]:
csv_1.head(2) # gives the first 2 rows

   A  B  C
0  1  2  4
1  0  3  9

In [8]:
csv_1.tail() # gives the last 5 rows

   A  B  C
1  0  3  9
2  4  0  5
3  6  9  6
4  7  6  1
5  3  8  2

In [9]:
csv_1.tail(2) # gives the last 2 rows

   A  B  C
4  7  6  1
5  3  8  2

In [10]:
csv_1[:2] # gives the data from index 0 to 1 (works same as slicing)

   A  B  C
0  1  2  4
1  0  3  9

In [11]:
csv_1[2:6] # gives the data from index 2 to 5 (works same as slicing)

   A  B  C
2  4  0  5
3  6  9  6
4  7  6  1
5  3  8  2

In [12]:
print(type(csv_1))

<class 'pandas.core.frame.DataFrame'>

In [13]:
csv_1.index.array # gives indexes in the form of array

<NumpyExtensionArray>
[0, 1, 2, 3, 4, 5]
Length: 6, dtype: int64

In [14]:
csv_1.to_numpy() # converts the csv file into 2-D numpy array

array([[1, 2, 4],
       [0, 3, 9],
       [4, 0, 5],
       [6, 9, 6],
       [7, 6, 1],
       [3, 8, 2]])

In [15]:
import numpy as np
np.asarray(csv_1) # It also converts csv file into numpy array

array([[1, 2, 4],
       [0, 3, 9],
       [4, 0, 5],
       [6, 9, 6],
       [7, 6, 1],
       [3, 8, 2]])

In [19]:
csv_1.sort_index(axis=0, ascending = False) # sorts in descending order row wise

   A  B  C
5  3  8  2
4  7  6  1
3  6  9  6
2  4  0  5
1  0  3  9
0  1  2  4

In [20]:
csv_1.sort_index(axis=1, ascending = False) # sorts in descending order column wise

   C  B  A
0  4  2  1
1  9  3  0
2  5  0  4
3  6  9  6
4  1  6  7
5  2  8  3

In [21]:
csv_1.sort_index(axis=1) # sorts in ascending order, which is by default

   A  B  C
0  1  2  4
1  0  3  9
2  4  0  5
3  6  9  6
4  7  6  1
5  3  8  2

In [28]:
csv_1.loc[0,"A"] = "Python" # change the value of 0th row and Ath column
csv_1

        A    B    C       0
0  Python  2.0  4.0     NaN
1       0  3.0  9.0     NaN
2       4  0.0  5.0     NaN
3       6  9.0  6.0     NaN
4       7  6.0  1.0     NaN
5       3  8.0  2.0     NaN
A     NaN  NaN  NaN  Python

In [29]:
csv_1.loc[[2,3],["A","B"]] # gives the data of 2nd and 3rd row of column A and B

   A    B
2  4  0.0
3  6  9.0

In [30]:
csv_1.loc[:,["A","C"]] # gives all the data of column A and C

        A    C
0  Python  4.0
1       0  9.0
2       4  5.0
3       6  6.0
4       7  1.0
5       3  2.0
A     NaN  NaN

In [33]:
csv_1.loc[[2,3],:] # gives all the data of 2nd and 3rd row

   A    B    C    0
2  4  0.0  5.0  NaN
3  6  9.0  6.0  NaN

In [36]:
name = csv_1.iloc[1,2] # gives the particular element/data (element at (1,2), first row and second column)
print(name)

9.0

In [38]:
csv_1.drop("B", axis=1) # drops column B

        A    C       0
0  Python  4.0     NaN
1       0  9.0     NaN
2       4  5.0     NaN
3       6  6.0     NaN
4       7  1.0     NaN
5       3  2.0     NaN
A     NaN  NaN  Python

In [41]:
csv_1.drop(1, axis=0) # drops row 1

        A    B    C       0
0  Python  2.0  4.0     NaN
2       4  0.0  5.0     NaN
3       6  9.0  6.0     NaN
4       7  6.0  1.0     NaN
5       3  8.0  2.0     NaN
A     NaN  NaN  NaN  Python